MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_gpio.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_gpio.c
 **
 ** A detailed description is available at
 ** @link GpioGroup Gpio description @endlink
 **
 **   - 2018-10-12  1.0  Zhangxl First version for Device Driver Library of Gpio.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_gpio.h"
#include "hc32f46x_utility.h"

#if (DDL_GPIO_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup GpioGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define GPIO_BASE (0x40053800ul)
#define PODR_BASE (0x0004ul)
#define POER_BASE (0x0006ul)
#define POSR_BASE (0x0008ul)
#define PORR_BASE (0x000Aul)
#define PCR_BASE (0x0400ul)
#define PFSR_BASE (0x0402ul)

/*! Parameter validity check for port group. */
#define IS_VALID_PORT(x) \
    (((x) == PortA) ||   \
     ((x) == PortB) ||   \
     ((x) == PortC) ||   \
     ((x) == PortD) ||   \
     ((x) == PortE) ||   \
     ((x) == PortH))

/*! Parameter validity check for pin. */
#define IS_VALID_PIN(x) \
    (((x) == Pin00) ||  \
     ((x) == Pin01) ||  \
     ((x) == Pin02) ||  \
     ((x) == Pin03) ||  \
     ((x) == Pin04) ||  \
     ((x) == Pin05) ||  \
     ((x) == Pin06) ||  \
     ((x) == Pin07) ||  \
     ((x) == Pin08) ||  \
     ((x) == Pin09) ||  \
     ((x) == Pin10) ||  \
     ((x) == Pin11) ||  \
     ((x) == Pin12) ||  \
     ((x) == Pin13) ||  \
     ((x) == Pin14) ||  \
     ((x) == Pin15))

/*! Parameter validity check for debug pins. */
#define IS_VALID_DEBUGPIN(x) ((x) <= 0x1Fu)

/*! Parameter validity check for pin mode. */
#define IS_VALID_PINMODE(x)   \
    (((x) == Pin_Mode_In) ||  \
     ((x) == Pin_Mode_Out) || \
     ((x) == Pin_Mode_Ana))

/*! Parameter validity check for pin drive capacity. */
#define IS_VALID_PINDRV(x) \
    (((x) == Pin_Drv_L) || \
     ((x) == Pin_Drv_M) || \
     ((x) == Pin_Drv_H))

/*! Parameter validity check for pin output type. */
#define IS_VALID_PINTYPE(x)     \
    (((x) == Pin_OType_Cmos) || \
     ((x) == Pin_OType_Od))

/*! Parameter validity check for pin read wait cycle. */
#define IS_VALID_READWAIT(x) \
    (((x) == WaitCycle0) ||  \
     ((x) == WaitCycle1) ||  \
     ((x) == WaitCycle2) ||  \
     ((x) == WaitCycle3))

/*! Parameter validity check for pin function */
#define IS_VALID_FUNC(x)         \
    (((x) == Func_Gpio) ||       \
     ((x) == Func_Fcmref) ||     \
     ((x) == Func_Rtcout) ||     \
     ((x) == Func_Vcout) ||      \
     ((x) == Func_Adtrg) ||      \
     ((x) == Func_Mclkout) ||    \
     ((x) == Func_Tim4) ||       \
     ((x) == Func_Tim6) ||       \
     ((x) == Func_Tima0) ||      \
     ((x) == Func_Tima1) ||      \
     ((x) == Func_Tima2) ||      \
     ((x) == Func_Emb) ||        \
     ((x) == Func_Usart_Ck) ||   \
     ((x) == Func_Spi_Nss) ||    \
     ((x) == Func_Qspi) ||       \
     ((x) == Func_Key) ||        \
     ((x) == Func_Sdio) ||       \
     ((x) == Func_I2s) ||        \
     ((x) == Func_UsbF) ||       \
     ((x) == Func_Evnpt) ||      \
     ((x) == Func_Eventout) ||   \
     ((x) == Func_Usart1_Tx) ||  \
     ((x) == Func_Usart3_Tx) ||  \
     ((x) == Func_Usart1_Rx) ||  \
     ((x) == Func_Usart3_Rx) ||  \
     ((x) == Func_Usart1_Rts) || \
     ((x) == Func_Usart3_Rts) || \
     ((x) == Func_Usart1_Cts) || \
     ((x) == Func_Usart3_Cts) || \
     ((x) == Func_Usart2_Tx) ||  \
     ((x) == Func_Usart4_Tx) ||  \
     ((x) == Func_Usart2_Rx) ||  \
     ((x) == Func_Usart4_Rx) ||  \
     ((x) == Func_Usart2_Rts) || \
     ((x) == Func_Usart4_Rts) || \
     ((x) == Func_Usart2_Cts) || \
     ((x) == Func_Usart4_Cts) || \
     ((x) == Func_Spi1_Mosi) ||  \
     ((x) == Func_Spi3_Mosi) ||  \
     ((x) == Func_Spi1_Miso) ||  \
     ((x) == Func_Spi3_Miso) ||  \
     ((x) == Func_Spi1_Nss0) ||  \
     ((x) == Func_Spi3_Nss0) ||  \
     ((x) == Func_Spi1_Sck) ||   \
     ((x) == Func_Spi3_Sck) ||   \
     ((x) == Func_Spi2_Mosi) ||  \
     ((x) == Func_Spi4_Mosi) ||  \
     ((x) == Func_Spi2_Miso) ||  \
     ((x) == Func_Spi4_Miso) ||  \
     ((x) == Func_Spi2_Nss0) ||  \
     ((x) == Func_Spi4_Nss0) ||  \
     ((x) == Func_Spi2_Sck) ||   \
     ((x) == Func_Spi4_Sck) ||   \
     ((x) == Func_I2c1_Sda) ||   \
     ((x) == Func_I2c3_Sda) ||   \
     ((x) == Func_I2c1_Scl) ||   \
     ((x) == Func_I2c3_Scl) ||   \
     ((x) == Func_I2c2_Sda) ||   \
     ((x) == Func_Can1_Tx) ||    \
     ((x) == Func_I2c2_Scl) ||   \
     ((x) == Func_Can1_Rx) ||    \
     ((x) == Func_I2s1_Sd) ||    \
     ((x) == Func_I2s3_Sd) ||    \
     ((x) == Func_I2s1_Sdin) ||  \
     ((x) == Func_I2s3_Sdin) ||  \
     ((x) == Func_I2s1_Ws) ||    \
     ((x) == Func_I2s3_Ws) ||    \
     ((x) == Func_I2s1_Ck) ||    \
     ((x) == Func_I2s3_Ck) ||    \
     ((x) == Func_I2s2_Sd) ||    \
     ((x) == Func_I2s4_Sd) ||    \
     ((x) == Func_I2s2_Sdin) ||  \
     ((x) == Func_I2s4_Sdin) ||  \
     ((x) == Func_I2s2_Ws) ||    \
     ((x) == Func_I2s4_Ws) ||    \
     ((x) == Func_I2s2_Ck) ||    \
     ((x) == Func_I2s4_Ck))

/*! Parameter validity check for pin sub-function */
#define IS_VALID_SUBFUNC(x)    \
    (((x) == Func_Gpio) ||     \
     ((x) == Func_Fcmref) ||   \
     ((x) == Func_Rtcout) ||   \
     ((x) == Func_Vcout) ||    \
     ((x) == Func_Adtrg) ||    \
     ((x) == Func_Mclkout) ||  \
     ((x) == Func_Tim4) ||     \
     ((x) == Func_Tim6) ||     \
     ((x) == Func_Tima0) ||    \
     ((x) == Func_Tima1) ||    \
     ((x) == Func_Tima2) ||    \
     ((x) == Func_Emb) ||      \
     ((x) == Func_Usart_Ck) || \
     ((x) == Func_Spi_Nss) ||  \
     ((x) == Func_Qspi) ||     \
     ((x) == Func_Key) ||      \
     ((x) == Func_Sdio) ||     \
     ((x) == Func_I2s) ||      \
     ((x) == Func_UsbF) ||     \
     ((x) == Func_Evnpt) ||    \
     ((x) == Func_Eventout))

